# первая ступень - компилятор и все необходимое для Go 1.18
FROM golang:1.18 as builder

# Соберем и запустим приложение в этой директории
WORKDIR /app

# Скопируем код программы в файловую систему контейнера
COPY main.go .

# Соберем программу из исходного кода, в файл hello-go
# Необходимо указать дополнительные флаги сборки Go
RUN CGO_ENABLED=0 GOOS=linux go build -a -o hello-go main.go

# вторая ступень - спартанская версия Linux Alpine
FROM alpine:3.15

# Используем такую же рабочую директорию
WORKDIR /app

# Скопируем собранный бинарный код из первой ступени
COPY --from=builder /app/hello-go .

# Запустим программу при запуске контейнера
CMD ["/app/hello-go"]
